InformationRegisters/ДлительныеДействия.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ДлительныеДействия</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ID_файла</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АвторДействия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АдресФайлаВХранилище</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВыполненоСОшибкой</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДействиеЗавершено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Имитация</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИмяДействияДляФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НаименованиеДействия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтменитьДействие</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОбъектДействия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Композиции</v8:Type>
						<v8:Type>cfg:CatalogRef.ИзделияКомплект</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УИДДействия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ДанныеСотрудников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ДанныеСотрудников</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>РежимРаботы</Name>
					<Type>
						<v8:Type>cfg:EnumRef.РежимыРаботы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ТипыЗадачКонструирования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыЗадачКонструирования</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВедущийКонструктор</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВнешнееПКД</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВнешнееПроизводство</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВнешнееПроизводствоГотово</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВнешнееПроизводствоОжидание</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВнешнееСогласование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГЧОжидание</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГЧПроверка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Дизайнер</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Завершение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗамерИзменение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗамерПроектный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗамерРабочий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗамерСоздан</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Конструктор</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Менеджер</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отмена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Разработка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Согласование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Финдиректор</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ТипыОбщихЗадач.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыОбщихЗадач</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Вопрос</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Информация</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CommonModules/омЗадачиОбщие/Ext/Module.bsl
Функция ПолучитьЗадачуПоОбъекту(ОбъектЗадачи, ТолькоНеВыполненые = Истина) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЕСТЬNULL(Задачи_ПКД.Ссылка, ЗНАЧЕНИЕ(Задача.Задачи_ПКД.ПустаяСсылка)) КАК Задачи,
		|	ВЫБОР
		|		КОГДА Задачи_ПКД.ТипЗадачи = ЗНАЧЕНИЕ(Перечисление.ТипыЗадачКонструирования.Конструктор)
		|				И НЕ(ТаймингЗадачСрезПоследних.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияЗадач.ОжиданиеКонструктором)
		|						ИЛИ ТаймингЗадачСрезПоследних.Состояние ЕСТЬ NULL
		|						ИЛИ ТаймингЗадачСрезПоследних.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияЗадач.ПустаяСсылка))
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК Задача_у_Конструктора
		|ИЗ
		|	Задача.Задачи_ПКД КАК Задачи_ПКД
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТаймингЗадач.СрезПоследних КАК ТаймингЗадачСрезПоследних
		|		ПО Задачи_ПКД.Ссылка = ТаймингЗадачСрезПоследних.Задача
		|ГДЕ
		|	Задачи_ПКД.ОбъектТЗ = &ОбъектТЗ
		|	И ВЫБОР
		|			КОГДА &ТолькоНеВыполненые
		|				ТОГДА НЕ Задачи_ПКД.Выполнена
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЕСТЬNULL(Задачи_РКД.Ссылка, ЗНАЧЕНИЕ(Задача.Задачи_РКД.ПустаяСсылка)),
		|	ВЫБОР
		|		КОГДА Задачи_РКД.ТипЗадачи = ЗНАЧЕНИЕ(Перечисление.ТипыЗадачКонструирования.Конструктор)
		|				И НЕ(ТаймингЗадачСрезПоследних.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияЗадач.ОжиданиеКонструктором)
		|						ИЛИ ТаймингЗадачСрезПоследних.Состояние ЕСТЬ NULL
		|						ИЛИ ТаймингЗадачСрезПоследних.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияЗадач.ПустаяСсылка))
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ
		|ИЗ
		|	Задача.Задачи_РКД КАК Задачи_РКД
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТаймингЗадач.СрезПоследних КАК ТаймингЗадачСрезПоследних
		|		ПО Задачи_РКД.Ссылка = ТаймингЗадачСрезПоследних.Задача
		|ГДЕ
		|	Задачи_РКД.ОбъектТЗ = &ОбъектТЗ
		|	И ВЫБОР
		|			КОГДА &ТолькоНеВыполненые
		|				ТОГДА НЕ Задачи_РКД.Выполнена
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ";
	
	Запрос.УстановитьПараметр("ТолькоНеВыполненые", ТолькоНеВыполненые);
	Запрос.УстановитьПараметр("ОбъектТЗ", 			ОбъектЗадачи);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если ТолькоНеВыполненые Тогда
			
			Если ЗначениеЗаполнено(Выборка.Задачи) Тогда
				Возврат Новый Структура("Задача, РаботаКонструктора", Выборка.Задачи, Выборка.Задача_у_Конструктора);	
			КонецЕсли;
			
		Иначе
			
			
			
		КонецЕсли;
		
	КонецЦикла; 
	
	Возврат Неопределено
	
КонецФункции // ПолучитьЗадачуПоОбъекту()

Процедура ЗаполнитьНачальныеДанныеЗадачиБагТрек(ДанныеФормы) Экспорт

	ДанныеФормы.ТипЗадачи 		= Перечисления.ТипыОбщихЗадач.Информация;
	
	Если ЗначениеЗаполнено(ДанныеФормы.ОбъектАдресации) Тогда
	
		ДанныеФормы.Проект = ДанныеФормы.ОбъектАдресации.Проект;	
	
	КонецЕсли;

КонецПроцедуры

Функция ВыполнитьДействиеДляКомплекта(УИДДействия, ДействиПриЗавершении) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДлительныеДействия.ОбъектДействия КАК ОбъектДействия
		|ПОМЕСТИТЬ вт
		|ИЗ
		|	РегистрСведений.ДлительныеДействия КАК ДлительныеДействия
		|ГДЕ
		|	ДлительныеДействия.УИДДействия = &УИДДействия
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Задачи_РКД.Ссылка КАК ЗадачаРКД
		|ИЗ
		|	вт КАК вт
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Задача.Задачи_РКД КАК Задачи_РКД
		|		ПО вт.ОбъектДействия = Задачи_РКД.ОбъектТЗ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	вт.ОбъектДействия КАК ОбъектДействия
		|ИЗ
		|	вт КАК вт";
	
	Запрос.УстановитьПараметр("УИДДействия", УИДДействия);
	
	Результат = Запрос.ВыполнитьПакет();
	
	ОбъектДействия = Неопределено;
	Выборка = Результат[2].Выбрать();
	Пока Выборка.Следующий() Цикл
		ОбъектДействия = Выборка.ОбъектДействия;
	КонецЦикла; 
	
	Выборка = Результат[1].Выбрать();
	Пока Выборка.Следующий() Цикл
		ЗадачаРКД = Выборка.ЗадачаРКД;
	КонецЦикла; 
	
	Если НЕ ЗначениеЗаполнено(ОбъектДействия) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если ДействиПриЗавершении = "ПереносВ_ПКД_ДизайнеромКорректировкаДизайнера" ИЛИ ДействиПриЗавершении = "ПереносВ_ПКД_ДизайнеромИзменениеЗаказчиком" Тогда
		
		Попытка
		
			Задачи.ПересогласованиеКомпозиции.СоздатьЗадачуПересоглосования(ОбъектДействия, ДействиПриЗавершении); 
		
		Исключение
			в = ОписаниеОшибки();	
 		КонецПопытки;
		
	ИначеЕсли ДействиПриЗавершении = "СбросДизайнеромКорректировкаДизайнера" ИЛИ ДействиПриЗавершении = "СбросДизайнеромИзменениеЗаказчиком" Тогда
		
		СтатусыДействия = омЗадачиПКДСервер.ПолучитьСтатусЗадачиПоДействию(ДействиПриЗавершении);
		Конструктор = омСотрудники.ПолучитьКонструктораРазработкиПользовательПоОбъекту(ОбъектДействия);
		Задачи.Задачи_ПКД.СоздатьЗадачуРКД(ОбъектДействия, Конструктор, СтатусыДействия.Статус, СтатусыДействия.Тип, Перечисления.СостоянияЗадач.ОжиданиеКонструктором);
		
		Если омКанбанПроизводство.РесурсВПроизводстве(ОбъектДействия) Тогда
			
			УИДКарточка = "";
			
			омКанбанПроизводство.ПеревестиКарточкуВПриостановку(ОбъектДействия, , УИДКарточка);
			омКанбанДоскиНаСервере.ЗаписатьТег(Справочники.Теги.Пересогласование, УИДКарточка);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецФункции // Перемемистить_задачу_с_РКД_в_ПКД(ЗадачаКомплект)   

Функция ПолучитьрежимРаботыИсполнителяЗадачи(Задача) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Задачи_РКД.ОбъектТЗ КАК ОбъектТЗ
		|ПОМЕСТИТЬ вт
		|ИЗ
		|	Задача.Задачи_РКД КАК Задачи_РКД
		|ГДЕ
		|	Задачи_РКД.Ссылка = &Задача
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДанныеСотрудниковСрезПоследних.РежимРаботы КАК РежимРаботы
		|ИЗ
		|	вт КАК вт
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеКомплекта.СрезПоследних КАК ДанныеКомплектаСрезПоследних
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеСотрудников.СрезПоследних КАК ДанныеСотрудниковСрезПоследних
		|			ПО ДанныеКомплектаСрезПоследних.Конструктор = ДанныеСотрудниковСрезПоследних.Сотрудник
		|		ПО вт.ОбъектТЗ = ДанныеКомплектаСрезПоследних.Комплект";
	
	
	Если ТипЗнч(Задача) = Тип("ЗадачаСсылка.Задачи_ПКД") Тогда
	
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Задачи_РКД", "Задачи_ПКД");	
	
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Задача", Задача);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.РежимРаботы;
	КонецЦикла;
	
	Возврат Перечисления.РежимыРаботы.ПустаяСсылка();

КонецФункции // получитьрежимРаботыИсполнителяЗадачи()

Функция ПолучитьНаименованиеЗадачи(Задача, Знач СтатусЗадачи = Неопределено, Знач ТипЗадачи = Неопределено, Знач СостояниеЗадачи = Неопределено, Комплект = Неопределено) Экспорт
	
	ТипЗадачиПКД = "П";
	ТипЗадачиРКД = "Р";
	
	Если ТипЗнч(Задача) = Тип("ЗадачаСсылка.Задачи_ПКД") Тогда
		ТипЗадачиСтрокой 		= ТипЗадачиПКД; 
		СтатусЗадачиУмолчание	= Перечисления.СтатусыЗадач.Разработка;
	Иначе	
		ТипЗадачиСтрокой 		= ТипЗадачиРКД;
		СтатусЗадачиУмолчание	= Перечисления.СтатусыЗадач.РазработкаРКД;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Задача) Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ТаймингЗадачСрезПоследних.Задача.ОбъектТЗ.Наименование КАК ОбъектТЗНаименование,
			|	ТаймингЗадачСрезПоследних.Состояние КАК СостояниеЗадачи,
			|	ТаймингЗадачСрезПоследних.ТипЗадачи КАК ТипЗадачи,
			|	ТаймингЗадачСрезПоследних.Статус КАК СтатусЗадачи,
			|	ДатыКомплекта.НомерДоработка КАК НомерДоработка,
			|	ДатыКомплекта.НомерПКД + 1 КАК НомерПКД,
			|	ДатыКомплекта.НомерРКД + 1 КАК НомерРКД,
			|	ДатыКомплекта.Рекламация КАК Рекламация,
			|	ДатыКомплекта.НомерИзменение КАК НомерИзменение,
			|	ДатыКомплекта.НомерКорректировка КАК НомерКорректировка
			|ИЗ
			|	РегистрСведений.ТаймингЗадач.СрезПоследних(, Задача = &Задача) КАК ТаймингЗадачСрезПоследних
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДатыКомплекта КАК ДатыКомплекта
			|		ПО ТаймингЗадачСрезПоследних.Задача.ОбъектТЗ = ДатыКомплекта.Комплект";
		
		
		Запрос.УстановитьПараметр("Задача", Задача);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			НаименованиеКомплекта 	= Выборка.ОбъектТЗНаименование;
			СтатусЗадачи			= ?(СтатусЗадачи 	= Неопределено, Выборка.СтатусЗадачи, 		СтатусЗадачи);
			ТипЗадачи				= ?(ТипЗадачи 		= Неопределено, Выборка.ТипЗадачи, 			ТипЗадачи);
			СостояниеЗадачи			= ?(СостояниеЗадачи = Неопределено, Выборка.СостояниеЗадачи, 	СостояниеЗадачи); 
			НомерПКД				= Выборка.НомерПКД;
			НомерРКД				= Выборка.НомерРКД;
			НомерДоработка			= Выборка.НомерДоработка;
			НомерИзменение			= Выборка.НомерИзменение;
			НомерКорректировка		= Выборка.НомерКорректировка;
			Рекламация				= Выборка.Рекламация;
		КонецЦикла;
		
	Иначе
		
		НаименованиеКомплекта 	= Комплект.Наименование;
		СтатусЗадачи			= ?(СтатусЗадачи 	= Неопределено, СтатусЗадачиУмолчание, 								СтатусЗадачи);
		СостояниеЗадачи			= ?(СостояниеЗадачи = Неопределено, Перечисления.СостоянияЗадач.ОжиданиеКонструктором, 	СостояниеЗадачи);
		ТипЗадачи				= ?(ТипЗадачи 		= Неопределено, Перечисления.ТипыЗадачКонструирования.Конструктор,	ТипЗадачи);
		НомерПКД 				= 1;
		НомерРКД 				= 1;
		НомерДоработка			= 0;
		НомерИзменение			= 0;
		НомерКорректировка		= 0;
		Рекламация				= Ложь;
	КонецЕсли;
	
	ЗначениеСтатуса = "";
	
	Если СтатусЗадачи = Перечисления.СтатусыЗадач.Изменение ИЛИ СтатусЗадачи = Перечисления.СтатусыЗадач.ИзменениеРКД Тогда
		ЗначениеСтатуса = "Изменение";	
	ИначеЕсли СтатусЗадачи = Перечисления.СтатусыЗадач.Корректировка ИЛИ СтатусЗадачи = Перечисления.СтатусыЗадач.КорректировкаРКД Тогда
		ЗначениеСтатуса = "Корректировка";
	ИначеЕсли СтатусЗадачи = Перечисления.СтатусыЗадач.Разработка ИЛИ СтатусЗадачи = Перечисления.СтатусыЗадач.РазработкаРКД Тогда
		ЗначениеСтатуса = "Разработка";
	ИначеЕсли СтатусЗадачи = Перечисления.СтатусыЗадач.ОжиданиеГЧ Тогда
		ЗначениеСтатуса = "ОжиданиеГЧ";
	ИначеЕсли СтатусЗадачи = Перечисления.СтатусыЗадач.ЗавершенаЗадача Тогда
		ЗначениеСтатуса = "Завершена";	
	ИначеЕсли СтатусЗадачи = Перечисления.СтатусыЗадач.Согласование Тогда
		ЗначениеСтатуса = "Согласование";
	КонецЕсли;
	
	ПолноеНаименованиеСтадии = "";
	СтадияКомплекта = омЗадачиПКДСервер.ПолучитьСтруктуруСтадий(СтатусЗадачи);
	СтадияКомплекта.ТекущиеСостояние = СостояниеЗадачи;
	СтадияКомплекта.ТекущийТипЗадачи = ТипЗадачи;
	омЗадачиПКДСервер.ПолучитьСтадиюКомплеткаНаОснованииПараметров(СтадияКомплекта, ПолноеНаименованиеСтадии);
	
	Если ТипЗадачи = Перечисления.ТипыЗадачКонструирования.Конструктор Тогда
	
		Если НомерДоработка > 0 Тогда
		
			ЗначениеСтатуса = "Доработка" + Формат(НомерДоработка, "ЧГ=0");		
		
		ИначеЕсли ЗначениеСтатуса = "Изменение" Тогда
		
			ЗначениеСтатуса = "Изменение" + ?(НомерИзменение = 0, "", Формат(НомерИзменение, "ЧГ=0"));		
		
		ИначеЕсли ЗначениеСтатуса = "Корректировка" Тогда
		
			ЗначениеСтатуса = "Корректировка" + ?(НомерКорректировка = 0, "", Формат(НомерКорректировка, "ЧГ=0"));		
		
		КонецЕсли;
		
		
	
	Иначе
	
		Если ЗначениеСтатуса = "Изменение" Тогда
		
			ЗначениеСтатуса = "Изменение" + ?(НомерИзменение = 0, "", Формат(НомерИзменение, "ЧГ=0"));		
		
		ИначеЕсли ЗначениеСтатуса = "Корректировка" Тогда
		
			ЗначениеСтатуса = "Корректировка" + ?(НомерКорректировка = 0, "", Формат(НомерКорректировка, "ЧГ=0"));		
		
		КонецЕсли;
		
	КонецЕсли;
	
	НомерЗадачи = Формат(НомерПКД, "ЧГ=0");
	
	Если ТипЗадачиСтрокой = ТипЗадачиРКД Тогда
		НомерЗадачи =  Формат(НомерРКД, "ЧГ=0") + "." + НомерЗадачи;	
	КонецЕсли;
	
	Если Рекламация Тогда
	
		ЗначениеСтатуса = ".Рекламация." + ЗначениеСтатуса;	
	
	КонецЕсли;
	
	Если НЕ ПустаяСтрока(ПолноеНаименованиеСтадии) Тогда
	
		ЗначениеСтатуса = ЗначениеСтатуса + "." + ПолноеНаименованиеСтадии;	
	
	КонецЕсли;
	
	Возврат СтрШаблон("%1.%2%3.%4", НаименованиеКомплекта, ТипЗадачиСтрокой, НомерЗадачи, ЗначениеСтатуса);

КонецФункции // ПолучитьНаименованиеЗадачи()

Процедура ИзменитьНаименованиеЗадачи(Задача) Экспорт
	
	Если ЗначениеЗаполнено(Задача) Тогда
		
		ЗадачаОбъект = Задача.ПолучитьОбъект();
		ЗадачаОбъект.Наименование = ПолучитьНаименованиеЗадачи(Задача);
		ЗадачаОбъект.Записать();
		
	КонецЕсли;
	
КонецПроцедуры


#Область СчетчикиСобытий

Функция ПолучитьНаименованиеПКД() Экспорт  //Не менять порядок в массиве!!!

	НаименованиеКнопокПКД = Новый Массив(19);
	
	НаименованиеКнопокПКД[0]  = "СчетчикиКнопки_ПКД_ДоработкаДизайнера";
	НаименованиеКнопокПКД[1]  = "СчетчикиКнопки_ПКД_КорректировкаДизайнер";
	НаименованиеКнопокПКД[2]  = "СчетчикиКнопки_ПКД_ВнешнееСоглосование";
	НаименованиеКнопокПКД[3]  = "СчетчикиКнопки_ПКД_Запрос";
	НаименованиеКнопокПКД[4]  = "СчетчикиКнопки_ПКД_Согласовано";
	НаименованиеКнопокПКД[5]  = "СчетчикиКнопки_ПКД_КонтрольКП";
	НаименованиеКнопокПКД[6]  = "СчетчикиКнопки_ПКД_ВозвратССогласования";
	НаименованиеКнопокПКД[7]  = "СчетчикиКнопки_ПКД_ВозвратСЗапроса";
	НаименованиеКнопокПКД[8]  = "СчетчикиКнопки_ПКД_СогласованоМенеджер";
	НаименованиеКнопокПКД[9]  = "СчетчикиКнопки_ПКД_НачатьВыполнениеКонструктор";
	НаименованиеКнопокПКД[10] = "СчетчикиКнопки_ПКД_ЗавершитьВыполнениеКонструктор";
	НаименованиеКнопокПКД[11] = "СчетчикиКнопки_ПКД_ПриостановитьКонструктор";
	НаименованиеКнопокПКД[12] = "СчетчикиКнопки_ПКД_СбросКонструктором";
	НаименованиеКнопокПКД[13] = "СчетчикиКнопки_ПКД_ДоработкаВедущийКонструктор";
	НаименованиеКнопокПКД[14] = "СчетчикиКнопки_ПКД_КонтрольВедущийКонструктор";
	НаименованиеКнопокПКД[15] = "СчетчикиКнопки_ПКД_СогласованоСИзменением";
	НаименованиеКнопокПКД[16] = "СчетчикиКнопки_ПКД_СогласованоБезИзменений";
	НаименованиеКнопокПКД[17] = "СчетчикиКнопки_ПКД_ОтменаИзделия";
	НаименованиеКнопокПКД[18] = "СчетчикиКнопки_ПКД_ИзменениеДизайнера";
	
	Возврат НаименованиеКнопокПКД;

КонецФункции // ПолучитьНаименованиеПКД()

Функция ПолучитьНаименованиеРКД() Экспорт  //Не менять порядок в массиве!!!

	НаименованиеКнопокПКД = Новый Массив(9);
	
	НаименованиеКнопокПКД[0] = "СчетчикиКнопки_РКД_НачатьВыполнениеКонструктор";
	НаименованиеКнопокПКД[1] = "СчетчикиКнопки_РКД_ЗавершитьВыполнениеКонструктор";
	НаименованиеКнопокПКД[2] = "СчетчикиКнопки_РКД_ПриостановитьКонструктор";
	НаименованиеКнопокПКД[3] = "СчетчикиКнопки_РКД_СбросКонструктором";
	НаименованиеКнопокПКД[4] = "СчетчикиКнопки_РКД_ДоработкаВедущийКонструктор";
	НаименованиеКнопокПКД[5] = "СчетчикиКнопки_РКД_УтвердитьВедущийКонструктор";
	НаименованиеКнопокПКД[6] = "СчетчикиКнопки_РКД_СбросДизайнеромКорректировкаДизайнера";
	НаименованиеКнопокПКД[7] = "СчетчикиКнопки_РКД_СбросДизайнеромИзменениеЗаказчиком";
	НаименованиеКнопокПКД[8] = "СчетчикиКнопки_РКД_ОжиданиеГЧ";
	
	Возврат НаименованиеКнопокПКД;

КонецФункции // ПолучитьНаименованиеПКД()   ОжиданиеГЧ

Функция ПолучитьНаименованиеСостояний() Экспорт  //Не менять порядок в массиве!!!

	НаименованиеКнопокПКД = Новый Массив(2);
	
	//НаименованиеКнопокПКД[0] = "СчетчикиКнопки_Сост_СтопНачало";
	//НаименованиеКнопокПКД[1] = "СчетчикиКнопки_Сост_СтопОстановка";
	НаименованиеКнопокПКД[0] = "СчетчикиКнопки_Сост_РекламацияНачало";
	НаименованиеКнопокПКД[1] = "СчетчикиКнопки_Сост_РекламацияОстановка";
	
	Возврат НаименованиеКнопокПКД;

КонецФункции // ПолучитьНаименованиеПКД()

Функция КолонкиТаблицаКнопокСостояние() Экспорт

	ИменаКолонок = Новый Массив(9);
	
	ИменаКолонок[0] = "Номер ПКД согласованное";
	ИменаКолонок[1] = "Номер ПКД не согласованное";
	ИменаКолонок[2] = "Номер РКД согласованное";
	ИменаКолонок[3] = "Номер РКД не согласованное";
	ИменаКолонок[4] = "Доработка";
	ИменаКолонок[5] = "Изменение";
	ИменаКолонок[6] = "Редакция";
	ИменаКолонок[7] = "Рекламация";
	ИменаКолонок[8] = "Согласование";
	
	Возврат ИменаКолонок;
	
КонецФункции // КолонкиТаблицаКнопокПКД()

Функция КолонкиТаблицаКнопокПКД() Экспорт

	ИменаКолонок = Новый Массив(10);
	ИменаКолонок[0] = "Номер ПКД согласованное";
	ИменаКолонок[1] = "Номер ПКД не согласованное";
	ИменаКолонок[2] = "Доработка";
	ИменаКолонок[3] = "Сброс доработка";
	ИменаКолонок[4] = "Сброс корректировка";
	ИменаКолонок[5] = "Сброс изменение";
	ИменаКолонок[6] = "Изменение";
	ИменаКолонок[7] = "Корректировка";
	ИменаКолонок[8] = "Рекламация";
	ИменаКолонок[9] = "Согласование";
	
	Возврат ИменаКолонок;
	
КонецФункции // КолонкиТаблицаКнопокПКД()

Функция КолонкиТаблицаКнопокРКД() Экспорт

	ИменаКолонок = Новый Массив(9);
	ИменаКолонок[0] = "Номер РКД согласованное";
	ИменаКолонок[1] = "Номер РКД не согласованное";
	ИменаКолонок[2] = "Доработка";
	ИменаКолонок[3] = "Сброс доработка";
	ИменаКолонок[4] = "Сброс корректировка";
	ИменаКолонок[5] = "Сброс изменение";
	ИменаКолонок[6] = "Изменение";
	ИменаКолонок[7] = "Корректировка";
	ИменаКолонок[8] = "Рекламация";
	
	Возврат ИменаКолонок;
	
КонецФункции // КолонкиТаблицаКнопокПКД()

	
#КонецОбласти
